app/views/comments/_form.html.erb

<% @post = Post.find_by_permalink(permalink) %>
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`permalink` = 'rails' LIMIT 1