app/views/tags/show.html.erb

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = ? LIMIT 1  [["id", 1]]
---
    <% @posttag.each do |p| %>
    <% if p.post.present? %>