app/views/posts/_show.html.erb

SELECT `posts`.* FROM `posts` WHERE `posts`.`permalink` = 'rails' LIMIT 1
---
 <%# raise params.inspect  %>
  <%  @post = Post.find_by_permalink(permalink) %>