app/views/posts/show.html.erb


              <p id="tagid" > Tags:- <% @post.tags.each do |tag| %>
---
SELECT `tags`.* FROM `tags` INNER JOIN `posttags` ON `tags`.`id` = `posttags`.`tag_id` WHERE `posttags`.`post_id` = ?  [["post_id", 1]]