app/controllers/categories_controller.rb

  def show

   # raise params.inspect
   @category = Category.find_by_permalink(params[:id])
   #raise @category.inspect
    @post =Post.where(:category_id => @category.id)
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`permalink` = 'educational' LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`category_id` = 2

  def create
    @category = Category.new(category_params)
    @category.save
---
INSERT INTO `categories` (`created_at`, `permalink`, `title`, `updated_at`, `user_id`) VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 14 Jan 2016 06:02:08 UTC +00:00], ["permalink", "educational"], ["title", "Educational"], ["updated_at", Thu, 14 Jan 2016 06:02:08 UTC +00:00], ["user_id", 1]]

  def update
     respond_to do |format|
    if @category.update(category_params)
---
UPDATE `categories` SET `title` = ?, `updated_at` = ? WHERE `categories`.`id` = 14  [["title", "Sport"], ["updated_at", Wed, 13 Jan 2016 14:03:54 UTC +00:00]]

  def destroy


    @category.destroy
---
DELETE FROM `categories` WHERE `categories`.`id` = ?  [["id", 1]]