app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` WHERE `posts`.`permalink` = 'rails' LIMIT 1
---
  def show
      @comment =Comment.new
      @post = Post.find_by_permalink(params[:id])

SELECT `categories`.* FROM `categories` WHERE `categories`.`permalink` = 'educational' LIMIT 1
SELECT `tags`.* FROM `tags`
---
  def new
       @category = Category.find_by_permalink(params[:category_id])
    #raise @category.inspect
    @post = Post.new
    @all_tags =Tag.all

INSERT INTO `posts` (`category_id`, `created_at`, `description`, `title`, `updated_at`, `user_id`) VALUES (?, ?, ?, ?, ?, ?)  [["category_id", 2], ["created_at", Thu, 14 Jan 2016 04:51:30 UTC +00:00], ["description", "hello"], ["title", "rails "], ["updated_at", Thu, 14 Jan 2016 04:51:30 UTC +00:00], ["user_id", 6]]
INSERT INTO `posttags` (`created_at`, `post_id`, `tag_id`, `updated_at`) VALUES (?, ?, ?, ?)  [["created_at", Thu, 14 Jan 2016 05:03:11 UTC +00:00], ["post_id", 4], ["tag_id", 1], ["updated_at", Thu, 14 Jan 2016 05:03:11 UTC +00:00]]
---
  def create
     # raise params.inspect
    user_id = current_user.id
    params["post"].merge!(user_id: current_user.id)


    @post = Post.new(post_params)
    @post.save

      some_hash = params.require(:tags)

      s = some_hash["id"].size
      for i in 0..s
      ch = some_hash["id"][i]
        if ch.to_s.empty?
        else

          @tag = Posttag.new(:post_id => @post.id , :tag_id => ch.to_i )
          @tag.save

SELECT `posts`.* FROM `posts` WHERE `posts`.`permalink` = 'demo' LIMIT 1
---
    def set_post
      @post = Post.find_by_permalink(params[:id])