app/views/categories/index.html.erb

SELECT COUNT(*) FROM `posts` WHERE `posts`.`category_id` = ?  [["category_id", 2]]
SELECT `posts`.* FROM `posts` WHERE `posts`.`category_id` = ?  [["category_id", 2]]
---

              <% if category.posts.count == 0  %>

SELECT COUNT(`comments`.`post_id`) FROM `comments` WHERE `comments`.`post_id` = ?  [["post_id", 1]]
---

            <% total_c=cp.comments.count(:post_id) %>

SELECT `tags`.* FROM `tags` WHERE `tags`.`title` = 'Java' LIMIT 1
---

        <% @cpost.map(&:tags).flatten.map(&:title).uniq.each do |t| %>